In [1]:
import pandas as pd

In [2]:
budgetdatadf = pd.read_csv('budget_data.csv')
budgetdatadf.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [3]:
#check data type
budgetdatadf.dtypes

Date             object
Profit/Losses     int64
dtype: object

In [4]:
budgetdatadf = pd.read_csv('budget_data.csv', parse_dates=['Date'])
budgetdatadf.head(10)

        Date  Profit/Losses
0 2010-01-01         867884
1 2010-02-01         984655
2 2010-03-01         322013
3 2010-04-01         -69417
4 2010-05-01         310503
5 2010-06-01         522857
6 2010-07-01        1033096
7 2010-08-01         604885
8 2010-09-01        -216386
9 2010-10-01         477532

In [5]:
budgetdatadf['Date'] = budgetdatadf['Date'].dt.to_period(freq = 'M')

In [6]:
budgetdatadf.head(100)

       Date  Profit/Losses
0   2010-01         867884
1   2010-02         984655
2   2010-03         322013
3   2010-04         -69417
4   2010-05         310503
..      ...            ...
81  2016-10         102685
82  2016-11         795914
83  2016-12          60988
84  2017-01         138230
85  2017-02         671099

[86 rows x 2 columns]

In [7]:
budgetdatadf.dtypes

Date             period[M]
Profit/Losses        int64
dtype: object

In [8]:
#aggregate budget data
#budgetdatadf = budgetdatadf.groupby(by=['Date']).sum()
#budgetdatadf
#found out there is no need to aggregate the data because there is only one column(P&L data) for each month already

In [9]:
#finding how many row we have
budgetdatadf.shape[0]

86

In [10]:
budgetdatadf['Profit/Losses'].sum()

38382578

In [11]:
#The average of the changes in Profit/Losses over the entire period.

budgetdatadf['shift1'] = budgetdatadf['Profit/Losses'].shift(1)
budgetdatadf.head()

      Date  Profit/Losses    shift1
0  2010-01         867884       NaN
1  2010-02         984655  867884.0
2  2010-03         322013  984655.0
3  2010-04         -69417  322013.0
4  2010-05         310503  -69417.0

In [12]:
#calculate net change
budgetdatadf['netchange'] = budgetdatadf['Profit/Losses'] - budgetdatadf['shift1']
budgetdatadf.head()

      Date  Profit/Losses    shift1  netchange
0  2010-01         867884       NaN        NaN
1  2010-02         984655  867884.0   116771.0
2  2010-03         322013  984655.0  -662642.0
3  2010-04         -69417  322013.0  -391430.0
4  2010-05         310503  -69417.0   379920.0

In [13]:
budgetdatadf.head(30)

       Date  Profit/Losses     shift1  netchange
0   2010-01         867884        NaN        NaN
1   2010-02         984655   867884.0   116771.0
2   2010-03         322013   984655.0  -662642.0
3   2010-04         -69417   322013.0  -391430.0
4   2010-05         310503   -69417.0   379920.0
5   2010-06         522857   310503.0   212354.0
6   2010-07        1033096   522857.0   510239.0
7   2010-08         604885  1033096.0  -428211.0
8   2010-09        -216386   604885.0  -821271.0
9   2010-10         477532  -216386.0   693918.0
10  2010-11         893810   477532.0   416278.0
11  2010-12         -80353   893810.0  -974163.0
12  2011-01         779806   -80353.0   860159.0
13  2011-02        -335203   779806.0 -1115009.0
14  2011-03         697845  -335203.0  1033048.0
15  2011-04         793163   697845.0    95318.0
16  2011-05         485070   793163.0  -308093.0
17  2011-06         584122   485070.0    99052.0
18  2011-07          62729   584122.0  -521393.0
19  2011-08         668179    62729.0   605450.0
20  2011-09         899906   668179.0   231727.0
21  2011-10         834719   899906.0   -65187.0
22  2011-11         132003   834719.0  -702716.0
23  2011-12         309978   132003.0   177975.0
24  2012-01        -755566   309978.0 -1065544.0
25  2012-02        1170593  -755566.0  1926159.0
26  2012-03         252788  1170593.0  -917805.0
27  2012-04        1151518   252788.0   898730.0
28  2012-05         817256  1151518.0  -334262.0
29  2012-06         570757   817256.0  -246499.0

In [14]:
#avearge of net change
round(budgetdatadf['netchange'].mean(),2)

-2315.12

In [15]:
#The greatest increase in profits (date and amount) over the entire period.
budgetdatadf['netchange'].max()

1926159.0

In [16]:
# getting the date of greatest increase 
budgetdatadf.netchange[budgetdatadf.netchange == budgetdatadf['netchange'].max()].index.tolist()
#above line's output is 25 
greatest_increase_date = budgetdatadf.iloc[25,0]
greatest_increase_date

Period('2012-02', 'M')

In [17]:
# getting The greatest decrease in losses (date and amount) over the entire period.
budgetdatadf['netchange'].min()

-2196167.0

In [18]:
# getting the date of greatest decrease
budgetdatadf.netchange[budgetdatadf.netchange == budgetdatadf['netchange'].min()].index.tolist()
greatest_decrease_date = budgetdatadf.iloc[44,0]
greatest_decrease_date

Period('2013-09', 'M')

In [19]:
#create a summary into a txt file

In [25]:
# Create Sales Summary into a text file
with open('Budget_Data_Analysis_Summary.txt',"w") as file:
    
    #multi line f string
    
    report = f"""
    Financial Analysis
    ----------------------------
    Total Months: {budgetdatadf.shape[0]} 
    
    Total: {round(budgetdatadf['Profit/Losses'].sum(),2)}
    
    Average Change: ${round(budgetdatadf['netchange'].mean(),2)}
    
    Greatest Increase in Profits: {greatest_increase_date.strftime('%b-%Y')} (${budgetdatadf['netchange'].max():.0f})
    
    Greatest Decrease in Profits: {greatest_decrease_date.strftime('%b-%Y')} (${budgetdatadf['netchange'].min():.0f})
    """
    
    file.write(report)